L = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print(len(L))  # 출력 : 10
print(L[1])  # 출력 : 1
print(L[-1])  # 출력 : 9
print(L[1: 3])  # 출력 : [1 , 2]
print(L[::2])  # 출력 : [0, 2, 4, 6, 8]
print(L[::-1])  # 출력 : [9, 8, 7, 6, 5, 4, 3, 2, 1, 0]
print(L[:])  # 출력 : [0, 1 , 2 ,3 ,4 ,5 ,6 ,7 ,8 ,9]
L[0:8] = []  # 출력 : [8, 9]
print(L + L)  # 출력 : [8, 9, 8, 9]
print(L * 3)  # 출력 : [8, 9, 8, 9, 8, 9]

L = list(range(10))  # 출력 : [0, 1 , 2 ,3 ,4 ,5 ,6 ,7 ,8 ,9]
print(list(range(5, 15, 2)))  # 출력 : [5, 7, 9, 11, 13]
print(list(range(10, 1, -1)))  # 출력 : [10, 9, 8, 7, 6, 5, 4, 3, 2]

s = [1, 2, 3]
s.append(5)  # 출력 : [1, 2, 3, 5]
s.insert(3, 4)  # 출력 : [1, 2, 3, 4 , 5]
print(s.index(3))  # 출력 : 2
print(s.count(2))  # 출력 : 1
s.remove(1)  # 출력 : [2, 3, 4, 5]
s.extend([60, 70])  # 출력 : [2, 3, 4, 5, 60, 70]
s.append([5, 6])  # 출력 : [70 , 60, 5, 4, 3, 2, [5,6]]
print(4 in L)  # 출력 : True
del L[0]  # 출력 : [2, 3, 4]


a = ['spam', 'eggs', 100, 1234]
a[2] = a[2] + 23
print(a)  # 출력 : ['spam', 'eggs', 123, 1234]

a = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
print(a[1:3][1])  # 출력 : [7,8,9]

L = [k * k for k in range(10)]
print(L)  # 출력 : [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
print(sum(L))  # 출력 : 285

L = [k * k for k in range(10) if k % 2 == 1]
print(L)  # 출력 : [1, 9, 25, 49, 81]

L = [(i, j, i * j) for i in range(2, 100, 2) for j in range(3, 100, 3) if (i + j) % 7 == 0]
print(L)  # 출력 : [(2, 12, 24), (2, 33, 66) ..

print(list({1: 2, 3: 4, 5: 6}))  # 출력 : 1, 3, 5







